tutorial_CSECGEFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0     0    0)
    (10e-3 0    0)
    (10e-3 5e-3 0)
    (0     5e-3 0)
    (0     0    1e-6)
    (10e-3 0    1e-6)
    (10e-3 5e-3 1e-6)
    (0     5e-3 1e-6)
);

blocks
(
     hex (0 1 2 3 4 5 6 7) (1600 800 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    bottom_wall
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    top_wall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    left_wall
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    right_wall
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
