tutorial_CSECGEFoam/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\ 
 | =========                 |                                                 |
 | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
 |  \\    /   O peration     | Version:  6                                     |
 |   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
 |    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/ 
FoamFile 
 { 
 	 version     2.0; 
 	 format      ascii; 
 	 class       dictionary; 
 	 location    "constant"; 
 	 object      transportProperties; 
 }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
phases (water air); 

water
 { 
 	 transportModel  Newtonian; 
 	 nu              nu [ 0 2 -1 0 0 0 0 ] 9.89e-07; 
 	 rho             rho [ 1 -3 0 0 0 0 0 ] 1075.05; 
	 D        D [ 0 2 -1 0 0 0 0 ] 4.80e-09;
 }

air 
 {
 	 transportModel  Newtonian; 
 	 nu              nu [ 0 2 -1 0 0 0 0 ] 0.00011; 
 	 rho             rho [ 1 -3 0 0 0 0 0 ] 0.082;
	 D        D [ 0 2 -1 0 0 0 0 ] 1e-05;
 }

molarmass         molarmass [ 1 0 0 0 -1 0 0 ] 2e-03; 

sigma           sigma [1 0 -2 0 0 0 0] 0.072;

Hei             Hei [0 0 0 0 0 0 0] 1e-4;

DPsi            DPsi [0 2 0 0 0 0 0] 1e-6;


k_gas   k_gas [ -1 -3 3 0 0 2 0 ] 1e-13; // S/m 
k_liquid   k_liquid [ -1 -3 3 0 0 2 0 ] 30.27; // S/m
