tutorial_CSECGEFoam/0/EP
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      EP;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [1 2 -3 0 0 -1 0]; 

internalField   uniform 0;

boundaryField
{
    bottom_wall
    {
        type            fixedValue;
	value		uniform 0.0;
    }
    top_wall
    {
        type            fixedValue;
	value		uniform 0.2;
    }
    left_wall
    {
        type            zeroGradient;
    }
    right_wall
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
