tutorial_CSECGEFoam/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 1
);

regions
(
    cylinderToCell
    {
	p1 (#calc "5e-3 - 4e-4" 0 -1);
	p2 (#calc "5e-3 + 4e-4" 0 1);
	radius 4e-4;

        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue Ci 0.0
        );
    }
);

// ************************************************************************* //
